/********************************************************************************************
* 文件名称:	Electronic.c																	*	
* 作成日期:	12/04/23																	    * 
* 作者:																					*
* 样式:		宏定义																			*
* 描述:	    整个系统的将二进制数据转换为十进制数，                                          *
            转换为相应的数据类型，取出有用数据                                          	*
*********************************************************************************************/
#define  GET_SHORT(date)    ((((date)&0x00ff)<<8)|((date)>>8))//将两字节转换为短整型
#define  GET_INT(date)      ((GET_SHORT( date & 0x0000ffff))<<16)|(GET_SHORT(date>>16))//将四字节转换为整型
#define  GET_CLASS(date)    (date & 15)//从四字节地图信息中获得dispclass值
#define  GET_CROSS(date)    ((date>>4) & 7)//从四字节地图信息中获得branch值
#define  GET_FLAG(date)     ((date>>7) & 1)//从四字节地图信息中获得flag值