/********************************************************************************************
* 文件名称:	myexit.c																	*	
* 作成日期:	12/04/25																	    * 
* 作者:																					*
* 样式:		退出系统																			*
* 描述:	    退出系统，并显示成员名字				                                            	*
*********************************************************************************************/
#include<stdio.h>
#include<windows.h>
#include"struct.h"

void myexit()
{
	printf("          感谢使用本系统！！！！！\n");
	printf("          本系统由........编写完成\n");
	exit(1);
}